{"timestamp": "2025-04-25T17:02:23.353755", "articles": [{"title": "Scientists Say They Can Calculate the Cost of Oil Giants' Role In Global Warming", "summary": "In a recent report, two scientists have claimed they can determine the financial costs associated with the contributions of oil giants to global warming, potentially holding these companies accountable for their environmental impact. This initiative is part of a broader trend where oil and gas firms are being challenged legally through numerous lawsuits aimed at addressing their responsibility for driving climate change. The calculation of these costs serves as a key step towards promoting sustainability and implicating polluting industries in climate change mitigation efforts.", "url": "https://science.slashdot.org/story/25/04/23/2238225/scientists-say-they-can-calculate-the-cost-of-oil-giants-role-in-global-warming", "published_at": "2025-04-24T13:00:00Z", "source": "Slashdot.org"}, {"title": "4 cabin crew and a passenger were injured when their United Airlines flight was hit by severe turbulence", "summary": "The key sustainability initiative in this article is that United Airlines operates Boeing 787 aircraft, which are known for their fuel efficiency and lower carbon emissions compared to older model planes. By utilizing these more sustainable aircraft, United Airlines is able to reduce its environmental impact in the aviation industry. In this incident, the sustainability aspect could also focus on the importance of maintaining the safety and well-being of passengers and crew to uphold a responsible and sustainable travel operation.", "url": "https://www.businessinsider.com/united-airlines-crew-passenger-injured-flight-encountered-severe-turbulence-2025-4", "published_at": "2025-04-24T11:14:33Z", "source": "Business Insider"}, {"title": "New smartphone labels for battery life and repairability are coming to the EU", "summary": "The European Union has introduced mandatory labels for smartphones and tablets, which will display ratings for energy efficiency, durability, and repairability. These labels aim to help consumers make more sustainable choices by providing transparency about a product's environmental impact and encouraging manufacturers to meet new ecodesign requirements for improved sustainability.", "url": "https://www.theverge.com/news/655275/smartphone-tablet-labels-eu-energy-efficiency-battery-life-repairability", "published_at": "2025-04-24T12:21:12Z", "source": "The Verge"}, {"title": "Miliband urges global cooperation amid energy 'challenges'", "summary": "In the news article, the UK Energy Secretary highlighted the importance of global cooperation to address energy challenges. The summit on energy security emphasizes the need for sustainable and collaborative efforts to tackle the complex issues surrounding energy production and consumption.", "url": "https://www.bbc.com/news/articles/cp8kr8k28z2o", "published_at": "2025-04-24T10:50:30Z", "source": "BBC News"}, {"title": "'One of my favourite wins' - Norrie battles illness to beat Landaluce", "summary": "The news article reported on British tennis player Cameron Norrie's remarkable win against Martin Landaluce at the Madrid Open, despite battling illness. While the focus of the article is on Norrie's personal achievement in the tennis match, there is no explicit mention of sustainability initiatives or impacts in the context of this news event.", "url": "https://www.bbc.com/sport/tennis/articles/cn0w8xj1g4go", "published_at": "2025-04-24T18:14:14Z", "source": "BBC News"}]}